### 📦 Plan for `sbx/eu-west-1/infra-01/vpc`
```hcl
05:23:47.309 STDOUT terraform: Terraform used the selected providers to generate the following execution
05:23:47.309 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
05:23:47.309 STDOUT terraform:   + create
05:23:47.309 STDOUT terraform: Terraform will perform the following actions:
05:23:47.309 STDOUT terraform:   # aws_eip.nat_gw_elastic_ip will be created
05:23:47.309 STDOUT terraform:   + resource "aws_eip" "nat_gw_elastic_ip" {
05:23:47.309 STDOUT terraform:       + allocation_id        = (known after apply)
05:23:47.309 STDOUT terraform:       + arn                  = (known after apply)
05:23:47.309 STDOUT terraform:       + association_id       = (known after apply)
05:23:47.309 STDOUT terraform:       + carrier_ip           = (known after apply)
05:23:47.309 STDOUT terraform:       + customer_owned_ip    = (known after apply)
05:23:47.309 STDOUT terraform:       + domain               = "vpc"
05:23:47.309 STDOUT terraform:       + id                   = (known after apply)
05:23:47.310 STDOUT terraform:       + instance             = (known after apply)
05:23:47.310 STDOUT terraform:       + ipam_pool_id         = (known after apply)
05:23:47.310 STDOUT terraform:       + network_border_group = (known after apply)
05:23:47.310 STDOUT terraform:       + network_interface    = (known after apply)
05:23:47.310 STDOUT terraform:       + private_dns          = (known after apply)
05:23:47.310 STDOUT terraform:       + private_ip           = (known after apply)
05:23:47.310 STDOUT terraform:       + ptr_record           = (known after apply)
05:23:47.310 STDOUT terraform:       + public_dns           = (known after apply)
05:23:47.310 STDOUT terraform:       + public_ip            = (known after apply)
05:23:47.310 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
05:23:47.310 STDOUT terraform:       + tags                 = {
05:23:47.310 STDOUT terraform:           + "Name" = "sbx-dev-eu-west-1-infra-01-nap-eip"
05:23:47.310 STDOUT terraform:         }
05:23:47.310 STDOUT terraform:       + tags_all             = {
05:23:47.310 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.310 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.310 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.310 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-nap-eip"
05:23:47.310 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.310 STDOUT terraform:         }
05:23:47.310 STDOUT terraform:       + vpc                  = (known after apply)
05:23:47.310 STDOUT terraform:     }
05:23:47.310 STDOUT terraform:   # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
05:23:47.310 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "flow_log" {
05:23:47.310 STDOUT terraform:       + arn               = (known after apply)
05:23:47.310 STDOUT terraform:       + id                = (known after apply)
05:23:47.310 STDOUT terraform:       + log_group_class   = (known after apply)
05:23:47.310 STDOUT terraform:       + name              = (known after apply)
05:23:47.310 STDOUT terraform:       + name_prefix       = (known after apply)
05:23:47.310 STDOUT terraform:       + retention_in_days = 0
05:23:47.310 STDOUT terraform:       + skip_destroy      = false
05:23:47.311 STDOUT terraform:       + tags              = {
05:23:47.311 STDOUT terraform:           + "Environment" = "dev"
05:23:47.311 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.311 STDOUT terraform:           + "infra"       = "true"
05:23:47.311 STDOUT terraform:         }
05:23:47.311 STDOUT terraform:       + tags_all          = {
05:23:47.311 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.311 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.311 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.311 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.311 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.311 STDOUT terraform:           + "infra"               = "true"
05:23:47.311 STDOUT terraform:         }
05:23:47.311 STDOUT terraform:     }
05:23:47.311 STDOUT terraform:   # module.vpc.aws_db_subnet_group.database[0] will be created
05:23:47.311 STDOUT terraform:   + resource "aws_db_subnet_group" "database" {
05:23:47.311 STDOUT terraform:       + arn                     = (known after apply)
05:23:47.311 STDOUT terraform:       + description             = "Database subnet group for sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.311 STDOUT terraform:       + id                      = (known after apply)
05:23:47.311 STDOUT terraform:       + name                    = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.311 STDOUT terraform:       + name_prefix             = (known after apply)
05:23:47.311 STDOUT terraform:       + subnet_ids              = (known after apply)
05:23:47.311 STDOUT terraform:       + supported_network_types = (known after apply)
05:23:47.311 STDOUT terraform:       + tags                    = {
05:23:47.311 STDOUT terraform:           + "Environment" = "dev"
05:23:47.311 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.311 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.311 STDOUT terraform:           + "infra"       = "true"
05:23:47.311 STDOUT terraform:         }
05:23:47.311 STDOUT terraform:       + tags_all                = {
05:23:47.311 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.311 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.311 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.311 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.311 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.311 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.311 STDOUT terraform:           + "infra"               = "true"
05:23:47.311 STDOUT terraform:         }
05:23:47.311 STDOUT terraform:       + vpc_id                  = (known after apply)
05:23:47.311 STDOUT terraform:     }
05:23:47.311 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
05:23:47.311 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
05:23:47.311 STDOUT terraform:       + arn                    = (known after apply)
05:23:47.311 STDOUT terraform:       + default_network_acl_id = (known after apply)
05:23:47.311 STDOUT terraform:       + id                     = (known after apply)
05:23:47.311 STDOUT terraform:       + owner_id               = (known after apply)
05:23:47.311 STDOUT terraform:       + tags                   = {
05:23:47.312 STDOUT terraform:           + "Environment" = "dev"
05:23:47.312 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.312 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.312 STDOUT terraform:           + "infra"       = "true"
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:       + tags_all               = {
05:23:47.312 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.312 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.312 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.312 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.312 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.312 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.312 STDOUT terraform:           + "infra"               = "true"
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:       + vpc_id                 = (known after apply)
05:23:47.312 STDOUT terraform:       + egress {
05:23:47.312 STDOUT terraform:           + action          = "allow"
05:23:47.312 STDOUT terraform:           + from_port       = 0
05:23:47.312 STDOUT terraform:           + ipv6_cidr_block = "::/0"
05:23:47.312 STDOUT terraform:           + protocol        = "-1"
05:23:47.312 STDOUT terraform:           + rule_no         = 101
05:23:47.312 STDOUT terraform:           + to_port         = 0
05:23:47.312 STDOUT terraform:             # (1 unchanged attribute hidden)
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:       + egress {
05:23:47.312 STDOUT terraform:           + action          = "allow"
05:23:47.312 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
05:23:47.312 STDOUT terraform:           + from_port       = 0
05:23:47.312 STDOUT terraform:           + protocol        = "-1"
05:23:47.312 STDOUT terraform:           + rule_no         = 100
05:23:47.312 STDOUT terraform:           + to_port         = 0
05:23:47.312 STDOUT terraform:             # (1 unchanged attribute hidden)
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:       + ingress {
05:23:47.312 STDOUT terraform:           + action          = "allow"
05:23:47.312 STDOUT terraform:           + from_port       = 0
05:23:47.312 STDOUT terraform:           + ipv6_cidr_block = "::/0"
05:23:47.312 STDOUT terraform:           + protocol        = "-1"
05:23:47.312 STDOUT terraform:           + rule_no         = 101
05:23:47.312 STDOUT terraform:           + to_port         = 0
05:23:47.312 STDOUT terraform:             # (1 unchanged attribute hidden)
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:       + ingress {
05:23:47.312 STDOUT terraform:           + action          = "allow"
05:23:47.312 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
05:23:47.312 STDOUT terraform:           + from_port       = 0
05:23:47.312 STDOUT terraform:           + protocol        = "-1"
05:23:47.312 STDOUT terraform:           + rule_no         = 100
05:23:47.312 STDOUT terraform:           + to_port         = 0
05:23:47.312 STDOUT terraform:             # (1 unchanged attribute hidden)
05:23:47.312 STDOUT terraform:         }
05:23:47.312 STDOUT terraform:     }
05:23:47.312 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
05:23:47.312 STDOUT terraform:   + resource "aws_default_route_table" "default" {
05:23:47.312 STDOUT terraform:       + arn                    = (known after apply)
05:23:47.312 STDOUT terraform:       + default_route_table_id = (known after apply)
05:23:47.312 STDOUT terraform:       + id                     = (known after apply)
05:23:47.312 STDOUT terraform:       + owner_id               = (known after apply)
05:23:47.312 STDOUT terraform:       + route                  = (known after apply)
05:23:47.312 STDOUT terraform:       + tags                   = {
05:23:47.313 STDOUT terraform:           + "Environment" = "dev"
05:23:47.313 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.313 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.313 STDOUT terraform:           + "infra"       = "true"
05:23:47.313 STDOUT terraform:         }
05:23:47.313 STDOUT terraform:       + tags_all               = {
05:23:47.313 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.313 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.313 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.313 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.313 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.313 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.313 STDOUT terraform:           + "infra"               = "true"
05:23:47.313 STDOUT terraform:         }
05:23:47.313 STDOUT terraform:       + vpc_id                 = (known after apply)
05:23:47.313 STDOUT terraform:       + timeouts {
05:23:47.313 STDOUT terraform:           + create = "5m"
05:23:47.313 STDOUT terraform:           + update = "5m"
05:23:47.313 STDOUT terraform:         }
05:23:47.313 STDOUT terraform:     }
05:23:47.313 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
05:23:47.313 STDOUT terraform:   + resource "aws_default_security_group" "this" {
05:23:47.313 STDOUT terraform:       + arn                    = (known after apply)
05:23:47.313 STDOUT terraform:       + description            = (known after apply)
05:23:47.313 STDOUT terraform:       + egress                 = (known after apply)
05:23:47.313 STDOUT terraform:       + id                     = (known after apply)
05:23:47.313 STDOUT terraform:       + ingress                = (known after apply)
05:23:47.313 STDOUT terraform:       + name                   = (known after apply)
05:23:47.313 STDOUT terraform:       + name_prefix            = (known after apply)
05:23:47.313 STDOUT terraform:       + owner_id               = (known after apply)
05:23:47.313 STDOUT terraform:       + revoke_rules_on_delete = false
05:23:47.313 STDOUT terraform:       + tags                   = {
05:23:47.313 STDOUT terraform:           + "Environment" = "dev"
05:23:47.313 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.313 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.313 STDOUT terraform:           + "infra"       = "true"
05:23:47.313 STDOUT terraform:         }
05:23:47.313 STDOUT terraform:       + tags_all               = {
05:23:47.313 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.313 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.313 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.313 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
05:23:47.313 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.313 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.313 STDOUT terraform:           + "infra"               = "true"
05:23:47.313 STDOUT terraform:         }
05:23:47.313 STDOUT terraform:       + vpc_id                 = (known after apply)
05:23:47.313 STDOUT terraform:     }
05:23:47.313 STDOUT terraform:   # module.vpc.aws_flow_log.this[0] will be created
05:23:47.313 STDOUT terraform:   + resource "aws_flow_log" "this" {
05:23:47.314 STDOUT terraform:       + arn                      = (known after apply)
05:23:47.314 STDOUT terraform:       + iam_role_arn             = (known after apply)
05:23:47.314 STDOUT terraform:       + id                       = (known after apply)
05:23:47.314 STDOUT terraform:       + log_destination          = (known after apply)
05:23:47.314 STDOUT terraform:       + log_destination_type     = "cloud-watch-logs"
05:23:47.314 STDOUT terraform:       + log_format               = (known after apply)
05:23:47.314 STDOUT terraform:       + log_group_name           = (known after apply)
05:23:47.314 STDOUT terraform:       + max_aggregation_interval = 60
05:23:47.314 STDOUT terraform:       + tags                     = {
05:23:47.314 STDOUT terraform:           + "Environment" = "dev"
05:23:47.314 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.314 STDOUT terraform:           + "infra"       = "true"
05:23:47.314 STDOUT terraform:         }
05:23:47.314 STDOUT terraform:       + tags_all                 = {
05:23:47.314 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.314 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.314 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.314 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.314 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.314 STDOUT terraform:           + "infra"               = "true"
05:23:47.314 STDOUT terraform:         }
05:23:47.314 STDOUT terraform:       + traffic_type             = "ALL"
05:23:47.314 STDOUT terraform:       + vpc_id                   = (known after apply)
05:23:47.314 STDOUT terraform:     }
05:23:47.314 STDOUT terraform:   # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
05:23:47.314 STDOUT terraform:   + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
05:23:47.314 STDOUT terraform:       + arn              = (known after apply)
05:23:47.314 STDOUT terraform:       + attachment_count = (known after apply)
05:23:47.314 STDOUT terraform:       + id               = (known after apply)
05:23:47.314 STDOUT terraform:       + name             = (known after apply)
05:23:47.314 STDOUT terraform:       + name_prefix      = "vpc-flow-log-to-cloudwatch-"
05:23:47.314 STDOUT terraform:       + path             = "/"
05:23:47.314 STDOUT terraform:       + policy           = jsonencode(
05:23:47.314 STDOUT terraform:             {
05:23:47.315 STDOUT terraform:               + Statement = [
05:23:47.315 STDOUT terraform:                   + {
05:23:47.315 STDOUT terraform:                       + Action   = [
05:23:47.315 STDOUT terraform:                           + "logs:PutLogEvents",
05:23:47.315 STDOUT terraform:                           + "logs:DescribeLogStreams",
05:23:47.315 STDOUT terraform:                           + "logs:DescribeLogGroups",
05:23:47.315 STDOUT terraform:                           + "logs:CreateLogStream",
05:23:47.315 STDOUT terraform:                         ]
05:23:47.315 STDOUT terraform:                       + Effect   = "Allow"
05:23:47.315 STDOUT terraform:                       + Resource = "*"
05:23:47.315 STDOUT terraform:                       + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
05:23:47.317 STDOUT terraform:                     },
05:23:47.317 STDOUT terraform:                 ]
05:23:47.317 STDOUT terraform:               + Version   = "2012-10-17"
05:23:47.317 STDOUT terraform:             }
05:23:47.317 STDOUT terraform:         )
05:23:47.317 STDOUT terraform:       + policy_id        = (known after apply)
05:23:47.317 STDOUT terraform:       + tags             = {
05:23:47.317 STDOUT terraform:           + "Environment" = "dev"
05:23:47.317 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.317 STDOUT terraform:           + "infra"       = "true"
05:23:47.317 STDOUT terraform:         }
05:23:47.317 STDOUT terraform:       + tags_all         = {
05:23:47.317 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.317 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.317 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.317 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.317 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.317 STDOUT terraform:           + "infra"               = "true"
05:23:47.317 STDOUT terraform:         }
05:23:47.317 STDOUT terraform:     }
05:23:47.317 STDOUT terraform:   # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
05:23:47.318 STDOUT terraform:   + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
05:23:47.318 STDOUT terraform:       + arn                   = (known after apply)
05:23:47.318 STDOUT terraform:       + assume_role_policy    = jsonencode(
05:23:47.318 STDOUT terraform:             {
05:23:47.318 STDOUT terraform:               + Statement = [
05:23:47.318 STDOUT terraform:                   + {
05:23:47.318 STDOUT terraform:                       + Action    = "sts:AssumeRole"
05:23:47.318 STDOUT terraform:                       + Effect    = "Allow"
05:23:47.318 STDOUT terraform:                       + Principal = {
05:23:47.318 STDOUT terraform:                           + Service = "vpc-flow-logs.amazonaws.com"
05:23:47.318 STDOUT terraform:                         }
05:23:47.318 STDOUT terraform:                       + Sid       = "AWSVPCFlowLogsAssumeRole"
05:23:47.318 STDOUT terraform:                     },
05:23:47.318 STDOUT terraform:                 ]
05:23:47.318 STDOUT terraform:               + Version   = "2012-10-17"
05:23:47.318 STDOUT terraform:             }
05:23:47.318 STDOUT terraform:         )
05:23:47.318 STDOUT terraform:       + create_date           = (known after apply)
05:23:47.318 STDOUT terraform:       + force_detach_policies = false
05:23:47.318 STDOUT terraform:       + id                    = (known after apply)
05:23:47.318 STDOUT terraform:       + managed_policy_arns   = (known after apply)
05:23:47.318 STDOUT terraform:       + max_session_duration  = 3600
05:23:47.318 STDOUT terraform:       + name                  = (known after apply)
05:23:47.318 STDOUT terraform:       + name_prefix           = "vpc-flow-log-role-"
05:23:47.318 STDOUT terraform:       + path                  = "/"
05:23:47.319 STDOUT terraform:       + tags                  = {
05:23:47.319 STDOUT terraform:           + "Environment" = "dev"
05:23:47.319 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.319 STDOUT terraform:           + "infra"       = "true"
05:23:47.319 STDOUT terraform:         }
05:23:47.319 STDOUT terraform:       + tags_all              = {
05:23:47.319 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.319 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.319 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.319 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.319 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.319 STDOUT terraform:           + "infra"               = "true"
05:23:47.319 STDOUT terraform:         }
05:23:47.319 STDOUT terraform:       + unique_id             = (known after apply)
05:23:47.319 STDOUT terraform:       + inline_policy (known after apply)
05:23:47.319 STDOUT terraform:     }
05:23:47.319 STDOUT terraform:   # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
05:23:47.319 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
05:23:47.319 STDOUT terraform:       + id         = (known after apply)
05:23:47.319 STDOUT terraform:       + policy_arn = (known after apply)
05:23:47.319 STDOUT terraform:       + role       = (known after apply)
05:23:47.319 STDOUT terraform:     }
05:23:47.319 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
05:23:47.319 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
05:23:47.319 STDOUT terraform:       + arn      = (known after apply)
05:23:47.319 STDOUT terraform:       + id       = (known after apply)
05:23:47.319 STDOUT terraform:       + owner_id = (known after apply)
05:23:47.319 STDOUT terraform:       + tags     = {
05:23:47.319 STDOUT terraform:           + "Environment" = "dev"
05:23:47.319 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.319 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.319 STDOUT terraform:           + "infra"       = "true"
05:23:47.319 STDOUT terraform:         }
05:23:47.319 STDOUT terraform:       + tags_all = {
05:23:47.319 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.319 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.319 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.319 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.319 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.319 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.319 STDOUT terraform:           + "infra"               = "true"
05:23:47.319 STDOUT terraform:         }
05:23:47.319 STDOUT terraform:       + vpc_id   = (known after apply)
05:23:47.319 STDOUT terraform:     }
05:23:47.319 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
05:23:47.319 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
05:23:47.319 STDOUT terraform:       + allocation_id                      = (known after apply)
05:23:47.319 STDOUT terraform:       + association_id                     = (known after apply)
05:23:47.319 STDOUT terraform:       + connectivity_type                  = "public"
05:23:47.319 STDOUT terraform:       + id                                 = (known after apply)
05:23:47.319 STDOUT terraform:       + network_interface_id               = (known after apply)
05:23:47.320 STDOUT terraform:       + private_ip                         = (known after apply)
05:23:47.320 STDOUT terraform:       + public_ip                          = (known after apply)
05:23:47.320 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
05:23:47.320 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
05:23:47.320 STDOUT terraform:       + subnet_id                          = (known after apply)
05:23:47.320 STDOUT terraform:       + tags                               = {
05:23:47.320 STDOUT terraform:           + "Environment" = "dev"
05:23:47.320 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"
05:23:47.320 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.320 STDOUT terraform:           + "infra"       = "true"
05:23:47.320 STDOUT terraform:         }
05:23:47.320 STDOUT terraform:       + tags_all                           = {
05:23:47.320 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.320 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.320 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.320 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"
05:23:47.320 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.320 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.320 STDOUT terraform:           + "infra"               = "true"
05:23:47.320 STDOUT terraform:         }
05:23:47.320 STDOUT terraform:     }
05:23:47.320 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
05:23:47.320 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
05:23:47.320 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
05:23:47.320 STDOUT terraform:       + id                     = (known after apply)
05:23:47.320 STDOUT terraform:       + instance_id            = (known after apply)
05:23:47.320 STDOUT terraform:       + instance_owner_id      = (known after apply)
05:23:47.320 STDOUT terraform:       + nat_gateway_id         = (known after apply)
05:23:47.320 STDOUT terraform:       + network_interface_id   = (known after apply)
05:23:47.320 STDOUT terraform:       + origin                 = (known after apply)
05:23:47.320 STDOUT terraform:       + route_table_id         = (known after apply)
05:23:47.320 STDOUT terraform:       + state                  = (known after apply)
05:23:47.320 STDOUT terraform:       + timeouts {
05:23:47.320 STDOUT terraform:           + create = "5m"
05:23:47.320 STDOUT terraform:         }
05:23:47.320 STDOUT terraform:     }
05:23:47.320 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
05:23:47.320 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
05:23:47.320 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
05:23:47.320 STDOUT terraform:       + gateway_id             = (known after apply)
05:23:47.321 STDOUT terraform:       + id                     = (known after apply)
05:23:47.321 STDOUT terraform:       + instance_id            = (known after apply)
05:23:47.321 STDOUT terraform:       + instance_owner_id      = (known after apply)
05:23:47.321 STDOUT terraform:       + network_interface_id   = (known after apply)
05:23:47.321 STDOUT terraform:       + origin                 = (known after apply)
05:23:47.321 STDOUT terraform:       + route_table_id         = (known after apply)
05:23:47.321 STDOUT terraform:       + state                  = (known after apply)
05:23:47.321 STDOUT terraform:       + timeouts {
05:23:47.321 STDOUT terraform:           + create = "5m"
05:23:47.321 STDOUT terraform:         }
05:23:47.321 STDOUT terraform:     }
05:23:47.321 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
05:23:47.321 STDOUT terraform:   + resource "aws_route_table" "private" {
05:23:47.321 STDOUT terraform:       + arn              = (known after apply)
05:23:47.321 STDOUT terraform:       + id               = (known after apply)
05:23:47.321 STDOUT terraform:       + owner_id         = (known after apply)
05:23:47.321 STDOUT terraform:       + propagating_vgws = (known after apply)
05:23:47.321 STDOUT terraform:       + route            = (known after apply)
05:23:47.321 STDOUT terraform:       + tags             = {
05:23:47.321 STDOUT terraform:           + "Environment" = "dev"
05:23:47.321 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-private"
05:23:47.321 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.321 STDOUT terraform:           + "infra"       = "true"
05:23:47.321 STDOUT terraform:         }
05:23:47.321 STDOUT terraform:       + tags_all         = {
05:23:47.321 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.321 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.321 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.321 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-private"
05:23:47.321 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.321 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.321 STDOUT terraform:           + "infra"               = "true"
05:23:47.321 STDOUT terraform:         }
05:23:47.321 STDOUT terraform:       + vpc_id           = (known after apply)
05:23:47.321 STDOUT terraform:     }
05:23:47.321 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
05:23:47.322 STDOUT terraform:   + resource "aws_route_table" "public" {
05:23:47.322 STDOUT terraform:       + arn              = (known after apply)
05:23:47.322 STDOUT terraform:       + id               = (known after apply)
05:23:47.322 STDOUT terraform:       + owner_id         = (known after apply)
05:23:47.322 STDOUT terraform:       + propagating_vgws = (known after apply)
05:23:47.322 STDOUT terraform:       + route            = (known after apply)
05:23:47.322 STDOUT terraform:       + tags             = {
05:23:47.322 STDOUT terraform:           + "Environment" = "dev"
05:23:47.322 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-public"
05:23:47.322 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.322 STDOUT terraform:           + "infra"       = "true"
05:23:47.322 STDOUT terraform:         }
05:23:47.322 STDOUT terraform:       + tags_all         = {
05:23:47.322 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.322 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.322 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.322 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-public"
05:23:47.322 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.322 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.322 STDOUT terraform:           + "infra"               = "true"
05:23:47.322 STDOUT terraform:         }
05:23:47.322 STDOUT terraform:       + vpc_id           = (known after apply)
05:23:47.322 STDOUT terraform:     }
05:23:47.322 STDOUT terraform:   # module.vpc.aws_route_table_association.database[0] will be created
05:23:47.322 STDOUT terraform:   + resource "aws_route_table_association" "database" {
05:23:47.322 STDOUT terraform:       + id             = (known after apply)
05:23:47.322 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.322 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.322 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.database[1] will be created
05:23:47.323 STDOUT terraform:   + resource "aws_route_table_association" "database" {
05:23:47.323 STDOUT terraform:       + id             = (known after apply)
05:23:47.323 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.323 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.323 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.database[2] will be created
05:23:47.323 STDOUT terraform:   + resource "aws_route_table_association" "database" {
05:23:47.323 STDOUT terraform:       + id             = (known after apply)
05:23:47.323 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.323 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.323 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
05:23:47.323 STDOUT terraform:   + resource "aws_route_table_association" "private" {
05:23:47.323 STDOUT terraform:       + id             = (known after apply)
05:23:47.323 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.323 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.323 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
05:23:47.323 STDOUT terraform:   + resource "aws_route_table_association" "private" {
05:23:47.323 STDOUT terraform:       + id             = (known after apply)
05:23:47.323 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.323 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.323 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.private[2] will be created
05:23:47.323 STDOUT terraform:   + resource "aws_route_table_association" "private" {
05:23:47.323 STDOUT terraform:       + id             = (known after apply)
05:23:47.323 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.323 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.323 STDOUT terraform:     }
05:23:47.323 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
05:23:47.324 STDOUT terraform:   + resource "aws_route_table_association" "public" {
05:23:47.324 STDOUT terraform:       + id             = (known after apply)
05:23:47.324 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.324 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.324 STDOUT terraform:     }
05:23:47.324 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
05:23:47.324 STDOUT terraform:   + resource "aws_route_table_association" "public" {
05:23:47.324 STDOUT terraform:       + id             = (known after apply)
05:23:47.324 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.324 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.324 STDOUT terraform:     }
05:23:47.324 STDOUT terraform:   # module.vpc.aws_route_table_association.public[2] will be created
05:23:47.324 STDOUT terraform:   + resource "aws_route_table_association" "public" {
05:23:47.324 STDOUT terraform:       + id             = (known after apply)
05:23:47.324 STDOUT terraform:       + route_table_id = (known after apply)
05:23:47.324 STDOUT terraform:       + subnet_id      = (known after apply)
05:23:47.324 STDOUT terraform:     }
05:23:47.324 STDOUT terraform:   # module.vpc.aws_subnet.database[0] will be created
05:23:47.324 STDOUT terraform:   + resource "aws_subnet" "database" {
05:23:47.324 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.324 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.324 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
05:23:47.324 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.324 STDOUT terraform:       + cidr_block                                     = "10.0.21.0/24"
05:23:47.324 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.324 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.324 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.324 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.324 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.324 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.324 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.324 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.324 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.324 STDOUT terraform:       + tags                                           = {
05:23:47.325 STDOUT terraform:           + "Environment" = "dev"
05:23:47.325 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"
05:23:47.325 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.325 STDOUT terraform:           + "infra"       = "true"
05:23:47.325 STDOUT terraform:         }
05:23:47.325 STDOUT terraform:       + tags_all                                       = {
05:23:47.325 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.325 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.325 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.325 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"
05:23:47.325 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.325 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.325 STDOUT terraform:           + "infra"               = "true"
05:23:47.325 STDOUT terraform:         }
05:23:47.325 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.325 STDOUT terraform:     }
05:23:47.325 STDOUT terraform:   # module.vpc.aws_subnet.database[1] will be created
05:23:47.325 STDOUT terraform:   + resource "aws_subnet" "database" {
05:23:47.325 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.325 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.325 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
05:23:47.325 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.325 STDOUT terraform:       + cidr_block                                     = "10.0.22.0/24"
05:23:47.325 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.325 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.325 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.325 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.325 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.325 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.325 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.325 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.325 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.326 STDOUT terraform:       + tags                                           = {
05:23:47.326 STDOUT terraform:           + "Environment" = "dev"
05:23:47.326 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"
05:23:47.326 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.326 STDOUT terraform:           + "infra"       = "true"
05:23:47.326 STDOUT terraform:         }
05:23:47.326 STDOUT terraform:       + tags_all                                       = {
05:23:47.326 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.326 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.326 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.326 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"
05:23:47.326 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.326 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.326 STDOUT terraform:           + "infra"               = "true"
05:23:47.326 STDOUT terraform:         }
05:23:47.326 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.326 STDOUT terraform:     }
05:23:47.326 STDOUT terraform:   # module.vpc.aws_subnet.database[2] will be created
05:23:47.326 STDOUT terraform:   + resource "aws_subnet" "database" {
05:23:47.326 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.326 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.326 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
05:23:47.326 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.326 STDOUT terraform:       + cidr_block                                     = "10.0.23.0/24"
05:23:47.326 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.326 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.326 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.326 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.326 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.326 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.326 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.326 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.327 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.327 STDOUT terraform:       + tags                                           = {
05:23:47.327 STDOUT terraform:           + "Environment" = "dev"
05:23:47.327 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"
05:23:47.327 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.327 STDOUT terraform:           + "infra"       = "true"
05:23:47.327 STDOUT terraform:         }
05:23:47.327 STDOUT terraform:       + tags_all                                       = {
05:23:47.327 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.327 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.327 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.327 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"
05:23:47.327 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.327 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.327 STDOUT terraform:           + "infra"               = "true"
05:23:47.327 STDOUT terraform:         }
05:23:47.327 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.327 STDOUT terraform:     }
05:23:47.327 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
05:23:47.327 STDOUT terraform:   + resource "aws_subnet" "private" {
05:23:47.327 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.327 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.327 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
05:23:47.327 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.327 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
05:23:47.327 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.327 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.327 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.327 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.327 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.327 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.327 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.328 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.328 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.328 STDOUT terraform:       + tags                                           = {
05:23:47.328 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.328 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"
05:23:47.328 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.328 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.328 STDOUT terraform:           + "infra"                           = "true"
05:23:47.328 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.328 STDOUT terraform:         }
05:23:47.328 STDOUT terraform:       + tags_all                                       = {
05:23:47.328 STDOUT terraform:           + "Data-classification"             = "internal"
05:23:47.328 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.328 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
05:23:47.328 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"
05:23:47.328 STDOUT terraform:           + "Organization"                    = "genopsx"
05:23:47.328 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.328 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.328 STDOUT terraform:           + "infra"                           = "true"
05:23:47.328 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.328 STDOUT terraform:         }
05:23:47.328 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.328 STDOUT terraform:     }
05:23:47.328 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
05:23:47.328 STDOUT terraform:   + resource "aws_subnet" "private" {
05:23:47.328 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.328 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.328 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
05:23:47.328 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.328 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
05:23:47.328 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.329 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.329 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.329 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.329 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.329 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.329 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.329 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.329 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.329 STDOUT terraform:       + tags                                           = {
05:23:47.329 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.329 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"
05:23:47.329 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.329 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.329 STDOUT terraform:           + "infra"                           = "true"
05:23:47.329 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.329 STDOUT terraform:         }
05:23:47.329 STDOUT terraform:       + tags_all                                       = {
05:23:47.329 STDOUT terraform:           + "Data-classification"             = "internal"
05:23:47.329 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.329 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
05:23:47.329 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"
05:23:47.329 STDOUT terraform:           + "Organization"                    = "genopsx"
05:23:47.329 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.329 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.329 STDOUT terraform:           + "infra"                           = "true"
05:23:47.329 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.329 STDOUT terraform:         }
05:23:47.329 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.330 STDOUT terraform:     }
05:23:47.330 STDOUT terraform:   # module.vpc.aws_subnet.private[2] will be created
05:23:47.330 STDOUT terraform:   + resource "aws_subnet" "private" {
05:23:47.330 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.330 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.330 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
05:23:47.330 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.330 STDOUT terraform:       + cidr_block                                     = "10.0.3.0/24"
05:23:47.330 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.330 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.330 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.330 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.330 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.330 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.330 STDOUT terraform:       + map_public_ip_on_launch                        = false
05:23:47.330 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.330 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.330 STDOUT terraform:       + tags                                           = {
05:23:47.330 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.330 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"
05:23:47.330 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.330 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.330 STDOUT terraform:           + "infra"                           = "true"
05:23:47.330 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.330 STDOUT terraform:         }
05:23:47.330 STDOUT terraform:       + tags_all                                       = {
05:23:47.330 STDOUT terraform:           + "Data-classification"             = "internal"
05:23:47.330 STDOUT terraform:           + "Environment"                     = "dev"
05:23:47.330 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
05:23:47.331 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"
05:23:47.331 STDOUT terraform:           + "Organization"                    = "genopsx"
05:23:47.331 STDOUT terraform:           + "PrivateSubnet"                   = "true"
05:23:47.331 STDOUT terraform:           + "Terragrunt"                      = "true"
05:23:47.331 STDOUT terraform:           + "infra"                           = "true"
05:23:47.331 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
05:23:47.331 STDOUT terraform:         }
05:23:47.331 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.331 STDOUT terraform:     }
05:23:47.331 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
05:23:47.331 STDOUT terraform:   + resource "aws_subnet" "public" {
05:23:47.331 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.331 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.331 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
05:23:47.331 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.331 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
05:23:47.331 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.331 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.331 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.331 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.331 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.331 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.331 STDOUT terraform:       + map_public_ip_on_launch                        = true
05:23:47.331 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.331 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.331 STDOUT terraform:       + tags                                           = {
05:23:47.331 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.331 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"
05:23:47.332 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.332 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.332 STDOUT terraform:           + "infra"                  = "true"
05:23:47.332 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.332 STDOUT terraform:         }
05:23:47.332 STDOUT terraform:       + tags_all                                       = {
05:23:47.332 STDOUT terraform:           + "Data-classification"    = "internal"
05:23:47.332 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.332 STDOUT terraform:           + "Managed-by"             = "terragrunt"
05:23:47.332 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"
05:23:47.332 STDOUT terraform:           + "Organization"           = "genopsx"
05:23:47.332 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.332 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.332 STDOUT terraform:           + "infra"                  = "true"
05:23:47.332 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.332 STDOUT terraform:         }
05:23:47.332 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.332 STDOUT terraform:     }
05:23:47.332 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
05:23:47.332 STDOUT terraform:   + resource "aws_subnet" "public" {
05:23:47.332 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.332 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.332 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
05:23:47.332 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.332 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
05:23:47.332 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.332 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.332 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.332 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.332 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.332 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.332 STDOUT terraform:       + map_public_ip_on_launch                        = true
05:23:47.332 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.333 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.333 STDOUT terraform:       + tags                                           = {
05:23:47.333 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.333 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"
05:23:47.333 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.333 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.333 STDOUT terraform:           + "infra"                  = "true"
05:23:47.333 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.333 STDOUT terraform:         }
05:23:47.333 STDOUT terraform:       + tags_all                                       = {
05:23:47.333 STDOUT terraform:           + "Data-classification"    = "internal"
05:23:47.333 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.333 STDOUT terraform:           + "Managed-by"             = "terragrunt"
05:23:47.333 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"
05:23:47.333 STDOUT terraform:           + "Organization"           = "genopsx"
05:23:47.333 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.333 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.333 STDOUT terraform:           + "infra"                  = "true"
05:23:47.333 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.333 STDOUT terraform:         }
05:23:47.333 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.333 STDOUT terraform:     }
05:23:47.333 STDOUT terraform:   # module.vpc.aws_subnet.public[2] will be created
05:23:47.333 STDOUT terraform:   + resource "aws_subnet" "public" {
05:23:47.333 STDOUT terraform:       + arn                                            = (known after apply)
05:23:47.333 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
05:23:47.333 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
05:23:47.333 STDOUT terraform:       + availability_zone_id                           = (known after apply)
05:23:47.333 STDOUT terraform:       + cidr_block                                     = "10.0.103.0/24"
05:23:47.333 STDOUT terraform:       + enable_dns64                                   = false
05:23:47.333 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:23:47.333 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:23:47.333 STDOUT terraform:       + id                                             = (known after apply)
05:23:47.333 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:23:47.334 STDOUT terraform:       + ipv6_native                                    = false
05:23:47.334 STDOUT terraform:       + map_public_ip_on_launch                        = true
05:23:47.334 STDOUT terraform:       + owner_id                                       = (known after apply)
05:23:47.334 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:23:47.334 STDOUT terraform:       + tags                                           = {
05:23:47.334 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.334 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"
05:23:47.334 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.334 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.334 STDOUT terraform:           + "infra"                  = "true"
05:23:47.334 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.334 STDOUT terraform:         }
05:23:47.334 STDOUT terraform:       + tags_all                                       = {
05:23:47.334 STDOUT terraform:           + "Data-classification"    = "internal"
05:23:47.334 STDOUT terraform:           + "Environment"            = "dev"
05:23:47.334 STDOUT terraform:           + "Managed-by"             = "terragrunt"
05:23:47.334 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"
05:23:47.334 STDOUT terraform:           + "Organization"           = "genopsx"
05:23:47.334 STDOUT terraform:           + "PublicSubnet"           = "true"
05:23:47.334 STDOUT terraform:           + "Terragrunt"             = "true"
05:23:47.334 STDOUT terraform:           + "infra"                  = "true"
05:23:47.334 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
05:23:47.334 STDOUT terraform:         }
05:23:47.334 STDOUT terraform:       + vpc_id                                         = (known after apply)
05:23:47.334 STDOUT terraform:     }
05:23:47.334 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
05:23:47.334 STDOUT terraform:   + resource "aws_vpc" "this" {
05:23:47.334 STDOUT terraform:       + arn                                  = (known after apply)
05:23:47.334 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
05:23:47.334 STDOUT terraform:       + default_network_acl_id               = (known after apply)
05:23:47.334 STDOUT terraform:       + default_route_table_id               = (known after apply)
05:23:47.334 STDOUT terraform:       + default_security_group_id            = (known after apply)
05:23:47.334 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
05:23:47.334 STDOUT terraform:       + enable_dns_hostnames                 = true
05:23:47.334 STDOUT terraform:       + enable_dns_support                   = true
05:23:47.334 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
05:23:47.335 STDOUT terraform:       + id                                   = (known after apply)
05:23:47.335 STDOUT terraform:       + instance_tenancy                     = "default"
05:23:47.335 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
05:23:47.335 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
05:23:47.335 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
05:23:47.335 STDOUT terraform:       + main_route_table_id                  = (known after apply)
05:23:47.335 STDOUT terraform:       + owner_id                             = (known after apply)
05:23:47.335 STDOUT terraform:       + tags                                 = {
05:23:47.335 STDOUT terraform:           + "Environment" = "dev"
05:23:47.335 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.335 STDOUT terraform:           + "Terragrunt"  = "true"
05:23:47.335 STDOUT terraform:           + "infra"       = "true"
05:23:47.335 STDOUT terraform:         }
05:23:47.335 STDOUT terraform:       + tags_all                             = {
05:23:47.335 STDOUT terraform:           + "Data-classification" = "internal"
05:23:47.335 STDOUT terraform:           + "Environment"         = "dev"
05:23:47.335 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:23:47.335 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
05:23:47.335 STDOUT terraform:           + "Organization"        = "genopsx"
05:23:47.335 STDOUT terraform:           + "Terragrunt"          = "true"
05:23:47.335 STDOUT terraform:           + "infra"               = "true"
05:23:47.335 STDOUT terraform:         }
05:23:47.335 STDOUT terraform:     }
05:23:47.335 STDOUT terraform: Plan: 35 to add, 0 to change, 0 to destroy.
05:23:47.335 STDOUT terraform: Changes to Outputs:
05:23:47.335 STDOUT terraform:   + azs              = [
05:23:47.335 STDOUT terraform:       + "eu-west-1a",
05:23:47.335 STDOUT terraform:       + "eu-west-1b",
05:23:47.335 STDOUT terraform:       + "eu-west-1c",
05:23:47.335 STDOUT terraform:     ]
05:23:47.335 STDOUT terraform:   + database_subnets = [
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:     ]
05:23:47.335 STDOUT terraform:   + private_subnets  = [
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:     ]
05:23:47.335 STDOUT terraform:   + public_subnets   = [
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:       + (known after apply),
05:23:47.335 STDOUT terraform:     ]
05:23:47.335 STDOUT terraform:   + vpc_cidr_block   = "10.0.0.0/16"
05:23:47.335 STDOUT terraform:   + vpc_id           = (known after apply)
05:23:47.335 STDOUT terraform:   + vpc_name         = "sbx-dev-eu-west-1-infra-01-vpc"
```
